IdeaRS.Connections
FasteningData.BoltInteraction Property
Compatible with IDEA StatiCa 0.0
 Indicates type of shear transfer
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public BoltShearType BoltInteraction { get; set; }
Property Value
Type: BoltShearType
See Also
Reference
FasteningData Class
IdeaRS.Connections.Data Namespace